INSERT INTO Department VALUES
('Marketing'),
('Financial'),
('Human resources'),
('IT');

SET IDENTITY_INSERT Employee ON;

INSERT INTO EMPLOYEE (Id, DepartmentId, ChiefId, Name, Salary)
VALUES
(1, 4, null, N'Иванов Иван Иванович', 500000.0000),
(2, 4, 1, N'Петров Петр Петрович', 500000.0000),
(3, 4, 1, N'Николаев Николай Николаевич', 400000.0000),
(4, 4, 2, N'Александров Александр Александрович', 300000.0000),
(5, 4, 2, N'Васильев Василий Васильевич', 200000.0000),
(6, 4, 2, N'Романов Роман Романович', 100000.0000),
(7, 4, 4, N'Сергеев Сергей Сергеевич', 100000.0000),
(8, 4, 4, N'Михайлов Михаил Михайлович', 100000.0000),
(9, 4, 4, N'Алексеев Алексей Алексеевич', 100000.0000),


(10, 3, null, N'Сидоров Сидор Сидорович', 100000.0000),
(11, 3, 10, N'Андреев Андрей Андреевич', 100000.0000),
(12, 3, 10, N'Ильин Илья Ильич', 100000.0000),

(13, 2, null, N'Богданов Богдан Богданович', 100000.0000),
(14, 2, 13, N'Русланов Руслан Русланович', 100000.0000),
(15, 2, 14, N'Константинов Константин Константинович', 100000.0000),

(16, 1, null, N'Данилов Данил Данилович', 100000.0000),
(17, 1, 16, N'Викторов Виктор Викторович', 100000.0000);


SET IDENTITY_INSERT Employee OFF;